In [2]:
#!pip install mysql-connector-python

In [3]:
import mysql.connector
#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "python-8am")
db = database.cursor()

In [4]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
           print(x)

(16, 'Bikash', 89, 77, 86, 74, 88, 420, 80.0, 'A')
(20, 'Nabina', 98, 46, 56, 76, 56, 420, 66.0, 'B')
(21, 'Shyam', 69, 55, 75, 72, 79, 390, 69.0, 'B')
(22, 'Rama', 90, 85, 95, 74, 89, 410, 89.0, 'A')
(23, 'Rabina', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(24, 'Anju', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(28, 'Rabin', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(29, 'Hari', 90, 91, 92, 93, 94, 460, 92.0, 'A')

In [5]:
#insert data into table
sql = ''' INSERT INTO `student` (`sn`, `name`, `physics`, `math`, `english`, `chemistry`, `nepali`, `total`, `per`, `grade`) 
VALUES ('25', 'Rabin', '98', '85', '77', '88', '92', '420', '91', 'A+');'''
db.execute(sql)
database.commit()
print(db.rowcount, "record inserted.")

1 record inserted.

In [15]:
name = input("Enter name: ")
m = float(input("marks in maths= "))
p = float(input("marks in physics= "))
n = float(input("marks in nepali= "))
e = float(input("marks in english= "))
c = float(input("marks in chemistry= "))
total = m+p+n+e+c
per = total/5

if ave>= 80:
    grade="A"
elif ave>= 60:
    grade ="B"
elif ave>= 45:
    grade = "c"
else:
    grade = "F"

sql = f''' INSERT INTO student (name, physics, math, english, chemistry, nepali, total, per, grade) 
       VALUES ('{name}', {m}, {p}, {n}, {e}, {c}, {total}, {per}, '{grade}')'''
db.execute(sql)
database.commit()
print(db.rowcount, "record inserted.")

Enter name: Hari
marks in maths= 90
marks in physics= 91
marks in nepali= 92
marks in english= 93
marks in chemistry= 94
1 record inserted.

In [6]:
# update sql

In [8]:
sql = "UPDATE student SET name = 'Ram' WHERE sn = 22"
db.execute(sql)
database.commit()
print(db.rowcount, "record(s) affected")

1 record(s) affected

In [9]:
# delete in sql

In [11]:
sql = "DELETE FROM student WHERE sn = 26 "
db.execute(sql)
database.commit()
print(db.rowcount, "record(s) deleted")

1 record(s) deleted

In [12]:
# (select)
db.execute("SELECT * FROM student WHERE grade = 'A'")
result =db.fetchall()
for x in result:
           print(x)

(16, 'Bikash', 89, 77, 86, 74, 88, 420, 80.0, 'A')
(22, 'Ram', 90, 85, 95, 74, 89, 410, 89.0, 'A')
(29, 'Hari', 90, 91, 92, 93, 94, 460, 92.0, 'A')

In [13]:
db.execute("SELECT * FROM student WHERE physics > 80")
result =db.fetchall()
for x in result:
           print(x)

(16, 'Bikash', 89, 77, 86, 74, 88, 420, 80.0, 'A')
(20, 'Nabina', 98, 46, 56, 76, 56, 420, 66.0, 'B')
(22, 'Ram', 90, 85, 95, 74, 89, 410, 89.0, 'A')
(23, 'Rabina', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(24, 'Anju', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(25, 'Rabin', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(28, 'Rabin', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(29, 'Hari', 90, 91, 92, 93, 94, 460, 92.0, 'A')

In [14]:
# search

In [16]:
db.execute("SELECT * FROM student WHERE name LIKE '%Ra%'")
result =db.fetchall()
for x in result:
           print(x)

(22, 'Ram', 90, 85, 95, 74, 89, 410, 89.0, 'A')
(23, 'Rabina', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(25, 'Rabin', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(28, 'Rabin', 98, 85, 77, 88, 92, 420, 91.0, 'A+')

In [17]:
db.execute("SELECT * FROM student WHERE physics > 80 and chemistry > 90")
result =db.fetchall()
for x in result:
           print(x)

(29, 'Hari', 90, 91, 92, 93, 94, 460, 92.0, 'A')

In [18]:
db.execute("SELECT * FROM student WHERE physics >= 80 or chemistry >= 90")
result =db.fetchall()
for x in result:
           print(x)

(16, 'Bikash', 89, 77, 86, 74, 88, 420, 80.0, 'A')
(20, 'Nabina', 98, 46, 56, 76, 56, 420, 66.0, 'B')
(22, 'Ram', 90, 85, 95, 74, 89, 410, 89.0, 'A')
(23, 'Rabina', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(24, 'Anju', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(25, 'Rabin', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(28, 'Rabin', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(29, 'Hari', 90, 91, 92, 93, 94, 460, 92.0, 'A')

In [19]:
db.execute("SELECT name,total,per,grade FROM student")
result =db.fetchall()
for x in result:
           print(x)

('Bikash', 420, 80.0, 'A')
('Nabina', 420, 66.0, 'B')
('Shyam', 390, 69.0, 'B')
('Ram', 410, 89.0, 'A')
('Rabina', 420, 91.0, 'A+')
('Anju', 420, 91.0, 'A+')
('Rabin', 420, 91.0, 'A+')
('Rabin', 420, 91.0, 'A+')
('Hari', 460, 92.0, 'A')

In [21]:
db.execute("SELECT * FROM student ORDER BY totala DESC ")
result =db.fetchall()
for x in result:
           print(x)

(29, 'Hari', 90, 91, 92, 93, 94, 460, 92.0, 'A')
(16, 'Bikash', 89, 77, 86, 74, 88, 420, 80.0, 'A')
(20, 'Nabina', 98, 46, 56, 76, 56, 420, 66.0, 'B')
(23, 'Rabina', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(24, 'Anju', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(25, 'Rabin', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(28, 'Rabin', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(22, 'Ram', 90, 85, 95, 74, 89, 410, 89.0, 'A')
(21, 'Shyam', 69, 55, 75, 72, 79, 390, 69.0, 'B')

In [23]:
db.execute("SELECT * FROM student ORDER BY total DESC ")
result =db.fetchall()
for x in result[0:5]:
           print(x)

(29, 'Hari', 90, 91, 92, 93, 94, 460, 92.0, 'A')
(16, 'Bikash', 89, 77, 86, 74, 88, 420, 80.0, 'A')
(20, 'Nabina', 98, 46, 56, 76, 56, 420, 66.0, 'B')
(23, 'Rabina', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(24, 'Anju', 98, 85, 77, 88, 92, 420, 91.0, 'A+')

In [6]:
db.execute("SELECT * FROM student ORDER BY name ASC ")
result =db.fetchall()
for x in result[0:5]:
           print(x)

(24, 'Anju', 98, 85, 77, 88, 92, 420, 91.0, 'A+')
(16, 'Bikash', 89, 77, 86, 74, 88, 420, 80.0, 'A')
(29, 'Hari', 90, 91, 92, 93, 94, 460, 92.0, 'A')
(20, 'Nabina', 98, 46, 56, 76, 56, 420, 66.0, 'B')
(25, 'Rabin', 98, 85, 77, 88, 92, 420, 91.0, 'A+')